Nope. The issue persists.

```
  # awscc_ce_anomaly_monitor.unit_dev must be replaced
-/+ resource "awscc_ce_anomaly_monitor" "unit_dev" {
      ~ creation_date           = "2021-12-16T21:42:08.713Z" -> (known after apply)
      ~ dimensional_value_count = 0 -> (known after apply)
      ~ id                      = "arn:aws:ce::XXX:anomalymonitor/846148c1-d6ea-4c4d-b316-d899a7d43e17" -> (known after apply)
      + last_evaluated_date     = (known after apply)
      ~ last_updated_date       = "2021-12-16T21:42:08.713Z" -> (known after apply)
      ~ monitor_arn             = "arn:aws:ce::XXX:anomalymonitor/846148c1-d6ea-4c4d-b316-d899a7d43e17" -> (known after apply)
      + monitor_dimension       = (known after apply)
      ~ monitor_specification   = jsonencode( # whitespace changes force replacement
            {
                Dimensions = {
                    Key    = "LINKED_ACCOUNT"
                    Values = [
                        "XXX",
                        "XXX",
                    ]
                }
            }
        )
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

```
Terraform v1.1.1
on darwin_amd64
+ provider registry.terraform.io/hashicorp/awscc v0.9.0
```